#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.pub_main["legacy"] will be created
  + resource "github_branch_protection" "pub_main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # github_branch_protection.pub_release["legacy"] will be created
  + resource "github_branch_protection" "pub_release" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "release/*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + required_approving_review_count = 2
          + restrict_dismissals             = false
        }
    }

  # github_repository.public["legacy"] will be created
  + resource "github_repository" "public" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archive_on_destroy     = true
      + archived               = false
      + auto_init              = true
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_issues             = true
      + has_projects           = true
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "legacy"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # github_repository_file.gitignore_file["legacy"] will be created
  + resource "github_repository_file" "gitignore_file" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = "Managed by GMaC"
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            #################################################
            # THIS IS A JOIN OF OTHER TEMPLATES             #
            # THE IGNORE ARE SEPARATED BY A COMMENT         #
            # WITH THE LANGUAGE/FRAMEWORK NAME              #
            # THIS IS CREATED TOGETHER WITH THE REPO        #
            # BUT IT ISN'T UPDATED, SO ANY ADDITION IS DONE #
            # IN A NEW COMMIT IN THE CREATED REPO           #
            # ALL OF THIS STUFF CAME FROM:                  #
            # https://github.com/github/gitignore           #
            #################################################
            
            # TERRAFORM #
            
            **/.terraform/*
            *.tfstate
            *.tfstate.*
            crash.log
            crash.*.log
            override.tf
            override.tf.json
            *_override.tf
            *_override.tf.json
            .terraformrc
            terraform.rc
            
            # PACKER #
            
            packer_cache/
            crash.log
            *.box
            
            # PYTHON #
            
            __pycache__/
            *.py[cod]
            *$py.class
            *.so
            .Python
            build/
            develop-eggs/
            dist/
            downloads/
            eggs/
            .eggs/
            lib/
            lib64/
            parts/
            sdist/
            var/
            wheels/
            share/python-wheels/
            *.egg-info/
            .installed.cfg
            *.egg
            MANIFEST
            *.manifest
            *.spec
            pip-log.txt
            pip-delete-this-directory.txt
            htmlcov/
            .tox/
            .nox/
            .coverage
            .coverage.*
            .cache
            nosetests.xml
            coverage.xml
            *.cover
            *.py,cover
            .hypothesis/
            .pytest_cache/
            cover/
            *.mo
            *.pot
            *.log
            local_settings.py
            db.sqlite3
            db.sqlite3-journal
            instance/
            .webassets-cache
            .scrapy
            docs/_build/
            .pybuilder/
            target/
            .ipynb_checkpoints
            profile_default/
            ipython_config.py
            .python-version
            .pdm.toml
            __pypackages__/
            celerybeat-schedule
            celerybeat.pid
            *.sage.py
            .env
            .venv
            env/
            venv/
            ENV/
            env.bak/
            venv.bak/
            .spyderproject
            .spyproject
            .ropeproject
            /site
            .mypy_cache/
            .dmypy.json
            dmypy.json
            .pyre/
            .pytype/
            cython_debug/
            idea/
            
            # GOLANG #
            
            *.exe
            *.exe~
            *.dll
            *.so
            *.dylib
            *.test
            *.out
            vendor/
            go.work
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "legacy"
      + sha                 = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ pub_http_clone_url = {
      + legacy = (known after apply)
    }
  ~ pub_ssh_clone_url  = {
      + legacy = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @ricardo-f, Action: `pull_request`, Working Directory: ``, Workflow: `Repository creation workflow`*